; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-3-29-27)
(:domain gripper-strips)
(:objects robot1 robot2 robot3 - robot
rgripper1 lgripper1 rgripper2 lgripper2 rgripper3 lgripper3 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 room19 room20 room21 room22 room23 room24 room25 room26 room27 room28 room29 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 - object)
(:init
(at-robby robot1 room3)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room13)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at-robby robot3 room23)
(free robot3 rgripper3)
(free robot3 lgripper3)
(at ball1 room7)
(at ball2 room20)
(at ball3 room28)
(at ball4 room12)
(at ball5 room27)
(at ball6 room6)
(at ball7 room23)
(at ball8 room5)
(at ball9 room5)
(at ball10 room27)
(at ball11 room4)
(at ball12 room23)
(at ball13 room29)
(at ball14 room18)
(at ball15 room19)
(at ball16 room9)
(at ball17 room13)
(at ball18 room6)
(at ball19 room28)
(at ball20 room13)
(at ball21 room5)
(at ball22 room27)
(at ball23 room21)
(at ball24 room3)
(at ball25 room23)
(at ball26 room29)
(at ball27 room23)
)
(:goal
(and
(at ball1 room17)
(at ball2 room3)
(at ball3 room7)
(at ball4 room11)
(at ball5 room9)
(at ball6 room26)
(at ball7 room10)
(at ball8 room21)
(at ball9 room24)
(at ball10 room15)
(at ball11 room14)
(at ball12 room29)
(at ball13 room19)
(at ball14 room12)
(at ball15 room3)
(at ball16 room13)
(at ball17 room11)
(at ball18 room20)
(at ball19 room2)
(at ball20 room20)
(at ball21 room3)
(at ball22 room7)
(at ball23 room19)
(at ball24 room16)
(at ball25 room12)
(at ball26 room16)
(at ball27 room8)
)
)
)

; plan
1. (pick robot3 ball7 room23 lgripper3)
   deleted: (at ball7 room23) (free robot3 lgripper3)
   added: (carry robot3 ball7 lgripper3)
   goals met: 0 of 27
2. (pick robot3 ball27 room23 rgripper3)
   deleted: (at ball27 room23) (free robot3 rgripper3)
   added: (carry robot3 ball27 rgripper3)
   goals met: 0 of 27
3. (pick robot2 ball20 room13 lgripper2)
   deleted: (at ball20 room13) (free robot2 lgripper2)
   added: (carry robot2 ball20 lgripper2)
   goals met: 0 of 27
4. (pick robot2 ball17 room13 rgripper2)
   deleted: (at ball17 room13) (free robot2 rgripper2)
   added: (carry robot2 ball17 rgripper2)
   goals met: 0 of 27
5. (pick robot1 ball24 room3 lgripper1)
   deleted: (at ball24 room3) (free robot1 lgripper1)
   added: (carry robot1 ball24 lgripper1)
   goals met: 0 of 27
6. (move robot3 room23 room8)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room8)
   goals met: 0 of 27
7. (move robot2 room13 room20)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room20)
   goals met: 0 of 27
8. (move robot1 room3 room4)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room4)
   goals met: 0 of 27
9. (drop robot3 ball27 room8 rgripper3)
   deleted: (carry robot3 ball27 rgripper3)
   added: (at ball27 room8) (free robot3 rgripper3)
   goals met: 1 of 27
10. (pick robot1 ball11 room4 rgripper1)
   deleted: (at ball11 room4) (free robot1 rgripper1)
   added: (carry robot1 ball11 rgripper1)
   goals met: 1 of 27
11. (drop robot2 ball20 room20 lgripper2)
   deleted: (carry robot2 ball20 lgripper2)
   added: (at ball20 room20) (free robot2 lgripper2)
   goals met: 2 of 27
12. (move robot1 room4 room16)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room16)
   goals met: 2 of 27
13. (move robot3 room8 room10)
   deleted: (at-robby robot3 room8)
   added: (at-robby robot3 room10)
   goals met: 2 of 27
14. (move robot2 room20 room12)
   deleted: (at-robby robot2 room20)
   added: (at-robby robot2 room12)
   goals met: 2 of 27
15. (drop robot1 ball24 room16 lgripper1)
   deleted: (carry robot1 ball24 lgripper1)
   added: (at ball24 room16) (free robot1 lgripper1)
   goals met: 3 of 27
16. (drop robot3 ball7 room10 lgripper3)
   deleted: (carry robot3 ball7 lgripper3)
   added: (at ball7 room10) (free robot3 lgripper3)
   goals met: 4 of 27
17. (pick robot2 ball4 room12 lgripper2)
   deleted: (at ball4 room12) (free robot2 lgripper2)
   added: (carry robot2 ball4 lgripper2)
   goals met: 4 of 27
18. (move robot1 room16 room14)
   deleted: (at-robby robot1 room16)
   added: (at-robby robot1 room14)
   goals met: 4 of 27
19. (move robot2 room12 room11)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room11)
   goals met: 4 of 27
20. (move robot3 room10 room23)
   deleted: (at-robby robot3 room10)
   added: (at-robby robot3 room23)
   goals met: 4 of 27
21. (drop robot1 ball11 room14 rgripper1)
   deleted: (carry robot1 ball11 rgripper1)
   added: (at ball11 room14) (free robot1 rgripper1)
   goals met: 5 of 27
22. (drop robot2 ball4 room11 lgripper2)
   deleted: (carry robot2 ball4 lgripper2)
   added: (at ball4 room11) (free robot2 lgripper2)
   goals met: 6 of 27
23. (drop robot2 ball17 room11 rgripper2)
   deleted: (carry robot2 ball17 rgripper2)
   added: (at ball17 room11) (free robot2 rgripper2)
   goals met: 7 of 27
24. (pick robot3 ball25 room23 lgripper3)
   deleted: (at ball25 room23) (free robot3 lgripper3)
   added: (carry robot3 ball25 lgripper3)
   goals met: 7 of 27
25. (pick robot3 ball12 room23 rgripper3)
   deleted: (at ball12 room23) (free robot3 rgripper3)
   added: (carry robot3 ball12 rgripper3)
   goals met: 7 of 27
26. (move robot3 room23 room29)
   deleted: (at-robby robot3 room23)
   added: (at-robby robot3 room29)
   goals met: 7 of 27
27. (move robot2 room11 room9)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room9)
   goals met: 7 of 27
28. (move robot1 room14 room9)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room9)
   goals met: 7 of 27
29. (drop robot3 ball12 room29 rgripper3)
   deleted: (carry robot3 ball12 rgripper3)
   added: (at ball12 room29) (free robot3 rgripper3)
   goals met: 8 of 27
30. (pick robot1 ball16 room9 lgripper1)
   deleted: (at ball16 room9) (free robot1 lgripper1)
   added: (carry robot1 ball16 lgripper1)
   goals met: 8 of 27
31. (move robot2 room9 room7)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room7)
   goals met: 8 of 27
32. (move robot3 room29 room12)
   deleted: (at-robby robot3 room29)
   added: (at-robby robot3 room12)
   goals met: 8 of 27
33. (move robot1 room9 room13)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room13)
   goals met: 8 of 27
34. (pick robot2 ball1 room7 lgripper2)
   deleted: (at ball1 room7) (free robot2 lgripper2)
   added: (carry robot2 ball1 lgripper2)
   goals met: 8 of 27
35. (drop robot3 ball25 room12 lgripper3)
   deleted: (carry robot3 ball25 lgripper3)
   added: (at ball25 room12) (free robot3 lgripper3)
   goals met: 9 of 27
36. (drop robot1 ball16 room13 lgripper1)
   deleted: (carry robot1 ball16 lgripper1)
   added: (at ball16 room13) (free robot1 lgripper1)
   goals met: 10 of 27
37. (move robot2 room7 room17)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room17)
   goals met: 10 of 27
38. (drop robot2 ball1 room17 lgripper2)
   deleted: (carry robot2 ball1 lgripper2)
   added: (at ball1 room17) (free robot2 lgripper2)
   goals met: 11 of 27
39. (move robot3 room12 room9)
   deleted: (at-robby robot3 room12)
   added: (at-robby robot3 room9)
   goals met: 11 of 27
40. (move robot1 room13 room9)
   deleted: (at-robby robot1 room13)
   added: (at-robby robot1 room9)
   goals met: 11 of 27
41. (move robot2 room17 room18)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room18)
   goals met: 11 of 27
42. (move robot1 room9 room6)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room6)
   goals met: 11 of 27
43. (move robot3 room9 room5)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room5)
   goals met: 11 of 27
44. (pick robot2 ball14 room18 lgripper2)
   deleted: (at ball14 room18) (free robot2 lgripper2)
   added: (carry robot2 ball14 lgripper2)
   goals met: 11 of 27
45. (pick robot1 ball6 room6 lgripper1)
   deleted: (at ball6 room6) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 11 of 27
46. (pick robot1 ball18 room6 rgripper1)
   deleted: (at ball18 room6) (free robot1 rgripper1)
   added: (carry robot1 ball18 rgripper1)
   goals met: 11 of 27
47. (pick robot3 ball9 room5 lgripper3)
   deleted: (at ball9 room5) (free robot3 lgripper3)
   added: (carry robot3 ball9 lgripper3)
   goals met: 11 of 27
48. (move robot2 room18 room12)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room12)
   goals met: 11 of 27
49. (move robot1 room6 room26)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room26)
   goals met: 11 of 27
50. (move robot3 room5 room24)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room24)
   goals met: 11 of 27
51. (drop robot2 ball14 room12 lgripper2)
   deleted: (carry robot2 ball14 lgripper2)
   added: (at ball14 room12) (free robot2 lgripper2)
   goals met: 12 of 27
52. (drop robot1 ball6 room26 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room26) (free robot1 lgripper1)
   goals met: 13 of 27
53. (drop robot3 ball9 room24 lgripper3)
   deleted: (carry robot3 ball9 lgripper3)
   added: (at ball9 room24) (free robot3 lgripper3)
   goals met: 14 of 27
54. (move robot1 room26 room20)
   deleted: (at-robby robot1 room26)
   added: (at-robby robot1 room20)
   goals met: 14 of 27
55. (move robot2 room12 room9)
   deleted: (at-robby robot2 room12)
   added: (at-robby robot2 room9)
   goals met: 14 of 27
56. (move robot3 room24 room9)
   deleted: (at-robby robot3 room24)
   added: (at-robby robot3 room9)
   goals met: 14 of 27
57. (drop robot1 ball18 room20 rgripper1)
   deleted: (carry robot1 ball18 rgripper1)
   added: (at ball18 room20) (free robot1 rgripper1)
   goals met: 15 of 27
58. (pick robot1 ball2 room20 lgripper1)
   deleted: (at ball2 room20) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 15 of 27
59. (move robot2 room9 room29)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room29)
   goals met: 15 of 27
60. (move robot3 room9 room5)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room5)
   goals met: 15 of 27
61. (move robot1 room20 room3)
   deleted: (at-robby robot1 room20)
   added: (at-robby robot1 room3)
   goals met: 15 of 27
62. (pick robot2 ball26 room29 lgripper2)
   deleted: (at ball26 room29) (free robot2 lgripper2)
   added: (carry robot2 ball26 lgripper2)
   goals met: 15 of 27
63. (pick robot2 ball13 room29 rgripper2)
   deleted: (at ball13 room29) (free robot2 rgripper2)
   added: (carry robot2 ball13 rgripper2)
   goals met: 15 of 27
64. (pick robot3 ball8 room5 lgripper3)
   deleted: (at ball8 room5) (free robot3 lgripper3)
   added: (carry robot3 ball8 lgripper3)
   goals met: 15 of 27
65. (pick robot3 ball21 room5 rgripper3)
   deleted: (at ball21 room5) (free robot3 rgripper3)
   added: (carry robot3 ball21 rgripper3)
   goals met: 15 of 27
66. (drop robot1 ball2 room3 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room3) (free robot1 lgripper1)
   goals met: 16 of 27
67. (move robot2 room29 room19)
   deleted: (at-robby robot2 room29)
   added: (at-robby robot2 room19)
   goals met: 16 of 27
68. (move robot3 room5 room3)
   deleted: (at-robby robot3 room5)
   added: (at-robby robot3 room3)
   goals met: 16 of 27
69. (drop robot2 ball13 room19 rgripper2)
   deleted: (carry robot2 ball13 rgripper2)
   added: (at ball13 room19) (free robot2 rgripper2)
   goals met: 17 of 27
70. (drop robot3 ball21 room3 rgripper3)
   deleted: (carry robot3 ball21 rgripper3)
   added: (at ball21 room3) (free robot3 rgripper3)
   goals met: 18 of 27
71. (move robot1 room3 room9)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room9)
   goals met: 18 of 27
72. (move robot2 room19 room16)
   deleted: (at-robby robot2 room19)
   added: (at-robby robot2 room16)
   goals met: 18 of 27
73. (move robot3 room3 room21)
   deleted: (at-robby robot3 room3)
   added: (at-robby robot3 room21)
   goals met: 18 of 27
74. (move robot1 room9 room19)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room19)
   goals met: 18 of 27
75. (drop robot2 ball26 room16 lgripper2)
   deleted: (carry robot2 ball26 lgripper2)
   added: (at ball26 room16) (free robot2 lgripper2)
   goals met: 19 of 27
76. (drop robot3 ball8 room21 lgripper3)
   deleted: (carry robot3 ball8 lgripper3)
   added: (at ball8 room21) (free robot3 lgripper3)
   goals met: 20 of 27
77. (pick robot3 ball23 room21 rgripper3)
   deleted: (at ball23 room21) (free robot3 rgripper3)
   added: (carry robot3 ball23 rgripper3)
   goals met: 20 of 27
78. (pick robot1 ball15 room19 lgripper1)
   deleted: (at ball15 room19) (free robot1 lgripper1)
   added: (carry robot1 ball15 lgripper1)
   goals met: 20 of 27
79. (move robot3 room21 room19)
   deleted: (at-robby robot3 room21)
   added: (at-robby robot3 room19)
   goals met: 20 of 27
80. (move robot1 room19 room3)
   deleted: (at-robby robot1 room19)
   added: (at-robby robot1 room3)
   goals met: 20 of 27
81. (move robot2 room16 room28)
   deleted: (at-robby robot2 room16)
   added: (at-robby robot2 room28)
   goals met: 20 of 27
82. (drop robot3 ball23 room19 rgripper3)
   deleted: (carry robot3 ball23 rgripper3)
   added: (at ball23 room19) (free robot3 rgripper3)
   goals met: 21 of 27
83. (drop robot1 ball15 room3 lgripper1)
   deleted: (carry robot1 ball15 lgripper1)
   added: (at ball15 room3) (free robot1 lgripper1)
   goals met: 22 of 27
84. (pick robot2 ball3 room28 lgripper2)
   deleted: (at ball3 room28) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 22 of 27
85. (pick robot2 ball19 room28 rgripper2)
   deleted: (at ball19 room28) (free robot2 rgripper2)
   added: (carry robot2 ball19 rgripper2)
   goals met: 22 of 27
86. (move robot2 room28 room7)
   deleted: (at-robby robot2 room28)
   added: (at-robby robot2 room7)
   goals met: 22 of 27
87. (move robot1 room3 room9)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room9)
   goals met: 22 of 27
88. (move robot3 room19 room9)
   deleted: (at-robby robot3 room19)
   added: (at-robby robot3 room9)
   goals met: 22 of 27
89. (drop robot2 ball3 room7 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room7) (free robot2 lgripper2)
   goals met: 23 of 27
90. (move robot3 room9 room27)
   deleted: (at-robby robot3 room9)
   added: (at-robby robot3 room27)
   goals met: 23 of 27
91. (move robot1 room9 room27)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room27)
   goals met: 23 of 27
92. (move robot2 room7 room2)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room2)
   goals met: 23 of 27
93. (pick robot1 ball5 room27 lgripper1)
   deleted: (at ball5 room27) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 23 of 27
94. (pick robot1 ball22 room27 rgripper1)
   deleted: (at ball22 room27) (free robot1 rgripper1)
   added: (carry robot1 ball22 rgripper1)
   goals met: 23 of 27
95. (pick robot3 ball10 room27 lgripper3)
   deleted: (at ball10 room27) (free robot3 lgripper3)
   added: (carry robot3 ball10 lgripper3)
   goals met: 23 of 27
96. (drop robot2 ball19 room2 rgripper2)
   deleted: (carry robot2 ball19 rgripper2)
   added: (at ball19 room2) (free robot2 rgripper2)
   goals met: 24 of 27
97. (move robot1 room27 room9)
   deleted: (at-robby robot1 room27)
   added: (at-robby robot1 room9)
   goals met: 24 of 27
98. (move robot3 room27 room15)
   deleted: (at-robby robot3 room27)
   added: (at-robby robot3 room15)
   goals met: 24 of 27
99. (drop robot1 ball5 room9 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room9) (free robot1 lgripper1)
   goals met: 25 of 27
100. (drop robot3 ball10 room15 lgripper3)
   deleted: (carry robot3 ball10 lgripper3)
   added: (at ball10 room15) (free robot3 lgripper3)
   goals met: 26 of 27
101. (move robot1 room9 room7)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room7)
   goals met: 26 of 27
102. (drop robot1 ball22 room7 rgripper1)
   deleted: (carry robot1 ball22 rgripper1)
   added: (at ball22 room7) (free robot1 rgripper1)
   goals met: 27 of 27
